{"pageProps":{"title":"🤖 Make a bot","content":"<p>Another week with ya boi chad_$yntax bringing you the best software podcast available in a format of exactly 31:33 seconds. No one else can top me at that. I would like to see them try. Other than that, we talked about making bots. Chat bots, twitter bots, discord bots, whatever. It's all about the learning experience. It's good practice and not a bad idea for a side project. Some bots can even make money, like moderation tools or bots with integrations. We then move onto a full-stack question about downloading xcel spreadsheets and the ways in which you can accomplish that. After that thrill ride we move onto an abridged \"day in the life\" of programming. If I made one of those cringe youtube videos all those other software engineers make it would be boring as hell. People who post those kinds of videos are trying to highlight their neat-o office and social life. All that time you spent recording videos of your snacks at the office could have been spent un-fucking your MR I have to review you fucking dipshit. Enjoy your fucking corn flakes, you better be able to deploy and chew at the same time. Otherwise your shortfall becomes my responsibility, and I fucking hate that. Fucking guy. &nbsp;Where was I... Oh right I have meetings and code every day, see episode 2 for the nitty gritty on scrum and tickets. We then move onto the final boss: koo-burr-net-eez. I kinda stumbled through this one ngl, but I think my general advice still stands. As I'm writing this I'm thinking of better answers. I guess I'll handle my own shortfall next week and re-answer it. Fucking guy. <br>\n<br>\nSee you next week!<br>\n<br>\nEmail me questions on software engineering:&nbsp;<a href=\"mailto:query@ttpspodcast.com\">query@ttpspodcast.com</a></p>\n<p>If you know your stuff and want to come on the show and chat&nbsp;<a href=\"mailto:guest@ttpspodcast.com\">guest@ttpspodcast.com</a></p>\n<p>If you want to collab or sponsor:&nbsp;<a href=\"mailto:business@ttpspodcast.com\">business@ttpspodcast.com</a></p>\n\n--- \n\nSend in a voice message: <a href=\"https://anchor.fm/ttps/message\" target=\"_blank\" rel=\"noopener noreferrer\">https://anchor.fm/ttps/message</a>","description":"Another week with ya boi chad_$yntax bringing you the best software podcast available in a format of exactly 31:33 seconds. No one else can top me at that. I would like to see them try. Other than that, we talked about making bots. Chat bots, twitter bots, discord bots, whatever. It's all about the learning experience. It's good practice and not a bad idea for a side project. Some bots can even make money, like moderation tools or bots with integrations. We then move onto a full-stack question about downloading xcel spreadsheets and the ways in which you can accomplish that. After that thrill ride we move onto an abridged \"day in the life\" of programming. If I made one of those cringe youtube videos all those other software engineers make it would be boring as hell. People who post those kinds of videos are trying to highlight their neat-o office and social life. All that time you spent recording videos of your snacks at the office could have been spent un-fucking your MR I have to review you fucking dipshit. Enjoy your fucking corn flakes, you better be able to deploy and chew at the same time. Otherwise your shortfall becomes my responsibility, and I fucking hate that. Fucking guy.  Where was I... Oh right I have meetings and code every day, see episode 2 for the nitty gritty on scrum and tickets. We then move onto the final boss: koo-burr-net-eez. I kinda stumbled through this one ngl, but I think my general advice still stands. As I'm writing this I'm thinking of better answers. I guess I'll handle my own shortfall next week and re-answer it. Fucking guy. \nquery@ttpspodcast.com\nIf you know your stuff and want to come on the show and chat guest@ttpspodcast.com\nIf you want to collab or sponsor: business@ttpspodcast.com\n\n--- \n\nSend in a voice message: https://anchor.fm/ttps/message","url":"https://anchor.fm/s/797bdf30/podcast/play/60008201/https%3A%2F%2Fd3ctxlq1ktw2nl.cloudfront.net%2Fstaging%2F2022-10-3%2Faed84358-b438-ca4f-5602-e79275fbc777.mp3","datePublished":"2022-11-03T06:55:40.000Z","dateModified":"2022-11-03T06:55:40.000Z"},"__N_SSG":true}